physicax-desktop/web/cfd/backend/uploads/11609c82e4/case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* Auto-generated controlDict (adjust as needed) */
application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         600;
deltaT          1;
writeControl    timeStep;
writeInterval   100;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
functions
{
    #includeFunc streamlinesLine
    (
        funcName=streamlines,
        start=(-3596.2779 -3983.9661 6.4089),
        end=(-3596.2779 3989.2180 6.4089),
        nPoints=36,
        setFormat=vtk,
        fields=(U p)
    )

    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        patches         (model);
        rhoInf          1.2040;
        magUInf         10000.0000;
        lRef            1993.2960;
        Aref            2102753.813000;
        CofR            (-8.3451 2.6260 6.4089);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        log             true;
        writeControl    timeStep;
        writeInterval   100;
    }

    forces
    {
        type            forces;
        libs            ("libforces.so");
        patches         (model);
        rhoInf          1.2040;
        CofR            (-8.3451 2.6260 6.4089);
        log             true;
        writeControl    timeStep;
        writeInterval   100;
    }
}
