physicax-desktop/web/cfd/backend/uploads/11609c82e4/case/system/sampleDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* Auto-generated sampleDict for PhysicaX */
sample
{
    type            sets;
    libs            ("libsampling.so");
    interpolationScheme cellPoint;
    setFormat       csv;

    fields          (U p);

    sets
    (
        uniformGrid
        {
            type        uniform;
            axis        xyz;
            start       (-3994.9372 -3983.9661 -3980.1832);
            end         (3978.2469 3989.2180 3993.0009);
            nPoints     (30 36 20);
        }
    );
}
